export default{
    getCountData: () => {
        return {
            "code": 200,
            "data": [
                {
                    "name": "学生数",
                    "value": 3484,
                    "icon": "Reading",
                    "color": "#386a8e"
                },
                {
                    "name": "教师数",
                    "value": 124,
                    "icon": "Guide",
                    "color": "#386a8e"
                },
                {
                    "name": "课程数",
                    "value": 73,
                    "icon": "Notebook",
                    "color": "#386a8e"
                }
            ]
        }
    },
    getChartData:()=>{
        return {
            "code": 200,
            "data": {
                "date": [
                    "2020",
                    "2021",
                    "2022",
                    "2023",
                    "2024",
                    "2025"
                ],
                "data": [
                    {
                        "学生数": 2765,
                        "教师数": 105,
                        "课程数": 64
                    },
                    {
                        "学生数": 2843,
                        "教师数": 102,
                        "课程数": 65
                    },
                    {
                        "学生数": 2882,
                        "教师数": 112,
                        "课程数": 69
                    },
                    {
                        "学生数": 2985,
                        "教师数": 120,
                        "课程数": 70
                    },
                    {
                        "学生数": 3507,
                        "教师数": 133,
                        "课程数": 86
                    },
                    {
                        "学生数": 3628,
                        "教师数": 139,
                        "课程数": 86
                    }
                ]
            }
        }
    }
}